cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Banana Pancakes
:PROPERTIES:
:export_file_name: banana-pancakes
:export_hugo_custom_front_matter: :servings 6
:export_hugo_custom_front_matter+: :prep-time 5
:export_hugo_custom_front_matter+: :cook-time 20
:export_hugo_custom_front_matter+: :ready-in 25
:export_author: Roonie
:END:
One of my absolute favorite recipes. It was discovered, and altered by
my wife. I enjoy them most with peanut butter and warm berries that were
heated from frozen. Try them with any toppings you'd like.

*** Ingredients

- 4 mashed bananas. 5 if you're extra.
- 2 tsp vanilla
- 4 eggs
- 3 tsp baking powder
- 3/4 cup flour
- 1 tbsp of butter per pan.

*** Directions

1. Peel and thoroughly mash the bananas into a bowl.
2. Add the vanilla and eggs to the bowl and whisk the wet mixture until
   well mixed.
3. Start heating a pan with butter in it at medium to medium-high heat.
4. Once pan is hot, add flour and baking powder to the wet mixture.
   Whisk in the dry ingredients until your batter is consistent.
5. Using a ladle or a large spoon, portion your pancakes in the hot pan
   with enough space between them to flip with. When you see the
   pancakes thicken and the bubbles pop on top of them, flip the
   pancakes.
6. Repeat steps 3-5 until your batter is used up.

