content/recipe/banana-pancakes.md
---
title: "Banana Pancakes"
author: ["Roonie"]
date: 2022-02-02T00:00:00-08:00
tags: ["GF", "easy", "fav"]
categories: ["breakfast"]
draft: false
servings: 6
prep-time: 5
cook-time: 20
ready-in: 25
---

One of my absolute favorite recipes. It was discovered, and altered by
my wife. I enjoy them most with peanut butter and warm berries that were
heated from frozen. Try them with any toppings you'd like.

Use 1-1 gluten free baking flour to make it GF.


## Ingredients {#ingredients}

-   4 mashed bananas. 5 if you're extra.
-   2 tsp vanilla
-   4 eggs
-   3 tsp baking powder
-   3/4 cup flour
-   1 tbsp of butter per pan.


## Directions {#directions}

1.  Peel and thoroughly mash the bananas into a bowl.
2.  Add the vanilla and eggs to the bowl and whisk the wet mixture until
    well mixed.
3.  Start heating a pan with butter in it at medium to medium-high heat.
4.  Once pan is hot, add flour and baking powder to the wet mixture.
    Whisk in the dry ingredients until your batter is consistent.
5.  Using a ladle or a large spoon, portion your pancakes in the hot pan
    with enough space between them to flip with. When you see the
    pancakes thicken and the bubbles pop on top of them, flip the
    pancakes.
6.  Repeat steps 3-5 until your batter is used up.